Repository: RomanGL/VKSaver
Catalog: VKSaver2/VKSaver/VKSaver.Shared/Strings/*/Resources.resw
Source language: en
Languages: ru_ru

# Message_VideoInfo_GetLinksFailed_Text
source: Failed to get the links for this video. There is no connection or access to the videos is closed.
ru_ru: Не удалось получить ссылки для этой видеозаписи. Отсутствует соединение либо доступ к видеозаписи закрыт.

# Message_VideoInfo_GetLinksFailed_Title
source: Failed to get the links
ru_ru: Не удалось получить ссылки

# AppBarButton_Player_Text
source: player
ru_ru: проигрыватель

# AppBarButton_TransferManager_Text
source: transfer manager
ru_ru: менеджер загрузок

# VideoAlbumVideosLoader.ErrorText
source: Failed to load the contents of the album
ru_ru: Не удалось загрузить содержимое альбома

# VideoAlbumVideosLoader.LoadingText
source: Loading the list of videos in the album...
ru_ru: Загружаем список видеозаписей альбома...

# VideoAlbumVideosLoader.NoDataText
source: There are no videos in this album
ru_ru: В этом альбоме нет видеозаписей

# SelectSearchTypeView_Title.Text
source: That you want to find?
ru_ru: Что вы хотите найти?

# SearchView_InCollection_Title.Header
source: in collection
ru_ru: в коллекции

# SearchView_Everywhere_Title.Header
source: everywhere
ru_ru: везде

# SearchView_SearchBox.PlaceholderText
source: Type your query and press Enter
ru_ru: введите запрос и нажмите Enter

# SearchView_Loader.ErrorText
source: Search failed
ru_ru: Не удалось выполнить поиск

# SearchView_Loader.LoadingText
source: Searching...
ru_ru: Выполняется поиск...

# SearchView_Loader.NoDataText
source: Nothing matches your search
ru_ru: По вашему запросу ничего не найдено

# AppBarButton_Filter_Text
source: filter
ru_ru: фильтр

# AudioSearchView_PerformerOnlySwitch.Header
source: Only search by performer
ru_ru: Искать только по исполнителю

# AudioSearchView_LyricsOnlySwitch.Header
source: Search only with lyrics
ru_ru: Искать только с текстом

# BetaBlockerView_Content.Text
source: Thank you for your participation! Download VK Saver 2 now!
ru_ru: Спасибо за участие! Загрузите ВКачай 2 сейчас!

# BetaBlockerView_DownloadButton.Content
source: go to download
ru_ru: перейти к загрузке

# BetaBlockerView_Title.Text
source: Beta test is finished
ru_ru: Бета-тест завершен

# VideoSearchView_FilterFlyout_Title.Text
source: Video filter
ru_ru: Фильтр видео

# VideoSearchView_Filters_All_Text
source: all
ru_ru: все

# VideoSearchView_OnlyHD_Switch.Header
source: HD Only
ru_ru: Только HD

# VideoSearchView_OwnVideos_Title.Header
source: uploaded
ru_ru: загруженные

# VideoSearchView_SafeSearch_Switch.Header
source: Safe search
ru_ru: Безопасный поиск

# VideoSearchView_VideoDurations_ComboBox.Header
source: Video duration
ru_ru: Длительность видео

# VideoSearchView_VideoDurations_Long_Text
source: long
ru_ru: длинные

# VideoSearchView_VideoDurations_Short_Text
source: short
ru_ru: короткие

# VideoSearchView_VideoSortMethods_ByDate_Text
source: by date
ru_ru: по дате добавления

# VideoSearchView_VideoSortMethods_ByDuration_Text
source: by duration
ru_ru: по длительности

# VideoSearchView_VideoSortMethods_ByRelevance_Text
source: by popularity
ru_ru: по популярности

# VideoSearchView_VideoSortMethods_ComboBox.Header
source: Sorting method
ru_ru: Метод сортировки

# VideoSearchView_VideoTypes_ComboBox.Header
source: Video type
ru_ru: Тип видео

# CaptchaBox.PrimaryButtonText
source: ok
ru_ru: ок

# CaptchaBox.SecondaryButtonText
source: cancel
ru_ru: отмена

# CaptchaBox.Title
source: Verification required
ru_ru: Требуется проверка

# CaptchaBox_Content.Text
source: Please enter the symbols you see in the picture
ru_ru: Введите символы, которые вы видите на картинке

# AppLoader_PleaseWait
source: Please wait...
ru_ru: Пожалуйста, подождите...

# ServiceName_VK_Text
source: VK
ru_ru: ВКонтакте

# ServiceAuthBlock_SignedInAs.Text
source: Signed in as
ru_ru: Вы вошли как

# ServiceAuthBlock_SignInButton.Content
source: sign in
ru_ru: войти

# ServiceAuthBlock_SignOutButton.Content
source: sign out
ru_ru: выйти

# SettingsView_ServicesAuthorizations_Title.Text
source: Authorization in the services
ru_ru: Авторизация в сервисах

# PackagingFilesView_Title.Text
source: processing
ru_ru: обработка

# PackagingFilesView_Processing.Text
source: Processing downloaded files... Please wait...
ru_ru: Выполняется обработка загруженных файлов... Пожалуйста, подождите...

# PromoView_LetsGoButton.Content
source: let's go!
ru_ru: начать

# PromoView_Screen0_Line1_Text
source: New features are waiting for you!
ru_ru: Новые функции ждут вас!

# PromoView_Screen0_Line2_Text
source: Are you ready? Then let's start!
ru_ru: Готовы? Тогда начнем!

# PromoView_Screen1_Line1_Text
source: Welcome back
ru_ru: Добро пожаловать!

# PromoView_Screen1_Line2_Text
source: VK Saver is up-to-date, read more about all features
ru_ru: ВКачай обновился, о всех новинках читайте далее

# PromoView_Screen2_Line1_Text
source: Caching tracks
ru_ru: Кэширование треков

# PromoView_Screen2_Line2_Text
source: Browsing cached tracks!
ru_ru: Кэшируйте треки для оффлайн воспроизведения!

# PromoView_Screen4_Line1_Text
source: Last.fm scrobbler
ru_ru: Мы знаем о музыке все!

# PromoView_Screen4_Line2_Text
source: Always up-to-date Last.fm profile!
ru_ru: Воспроизводите треки любимых исполнителей

# PromoView_NextButton.Content
source: next
ru_ru: далее

# ArtistAlbumView_DetailsLoader.ErrorText
source: Unable to load the details about this album
ru_ru: Не удалось загрузить информацию об этом альбоме

# ArtistAlbumView_DetailsLoader.LoadingText
source: Collecting details about the album...
ru_ru: Собираем информацию об альбоме...

# ArtistAlbumView_DetailsLoader.NoDataText
source: Unfortunately, we don't know any details about this album
ru_ru: К сожалению, мы не знаем никаких подробностей об этом альбоме

# ArtistAlbumView_PivotSection_Details.Header
source: details
ru_ru: подробнее

# ArtistAlbumView_PivotSection_Tracks.Header
source: tracks
ru_ru: композиции

# ArtistAlbumView_TracksLoader.ErrorText
source: Failed to load the tracks list of this album
ru_ru: Не удалось загрузить список треков этого альбома

# ArtistAlbumView_TracksLoader.LoadingText
source: Exploring the tracks list of this album...
ru_ru: Изучаем список композиций этого альбома...

# ArtistAlbumView_TracksLoader.NoDataText
source: In this album there is no tracks
ru_ru: В этом альбоме нет ни одной композиции

# NewsMediaView_Title.Text
source: news
ru_ru: новости

# NewsMediaView_Loader.ErrorText
source: Failed to load the list of news
ru_ru: Не удалось загрузить список новостей

# NewsMediaView_Loader.LoadingText
source: Loading the latest news list...
ru_ru: Загружаем список последних новостей...

# NewsMediaView_Loader.NoDataText
source: In the latest news audio not found
ru_ru: В последних новостях не найдено ни одной аудиозаписи

# MainView_CachedItem.Content
source: cached tracks
ru_ru: кэшированные

# AppBarButton_DeleteAll_Text
source: remove all
ru_ru: удалить все

# CachedView_Loader.ErrorText
source: Failed to load the list of cached tracks...
ru_ru: Не удалось загрузить список кэшированных аудиозаписей

# CachedView_Loader.LoadingText
source: Loading cached tracks...
ru_ru: Загружаем кэшированные аудиозаписи...

# CachedView_Loader.NoDataText
source: There is no cached tracks
ru_ru: Кэшированные аудиозаписи отсутствуют

# CachedView_Title.Text
source: cached tracks
ru_ru: кэшированные

# Message_ClearCacheError_Text
source: An error occurred while clearing the cache. Please try again later.
ru_ru: При очистке кэша аудиозаписей произошла ошибка. Повторите попытку позднее.

# Message_ClearCacheError_Title
source: Failed to clear the cache
ru_ru: Не удалось очистить кэш

# LoginView_LoginField.PlaceholderText
source: username or email
ru_ru: имя пользователя или email

# LoginView_PasswordField.PlaceholderText
source: password
ru_ru: пароль

# Message_Login_InvalidAccount_Text
source: Invalid username or password.
ru_ru: Неверное имя пользователя или пароль.

# Message_Login_LfConnectionError_Text
source: Unable to connect to Last.fm. Check the access to the Internet and try again.
ru_ru: Не удалось подключиться к Last.fm. Проверьте доступ к интернету и повторите попытку.

# FileSize_Bytes_Mask_Text
source: {0} bytes
ru_ru: {0} байт

# FileSize_EB_Mask_Text
source: {0} EB
ru_ru: {0} ЭБ

# FileSize_GB_Mask_Text
source: {0} GB
ru_ru: {0} ГБ

# FileSize_KB_Mask_Text
source: {0} KB
ru_ru: {0} КБ

# FileSize_MB_Mask_Text
source: {0} MB
ru_ru: {0} МБ

# FileSize_PB_Mask_Text
source: {0} PB
ru_ru: {0} ПБ

# FileSize_TB_Mask_Text
source: {0} TB
ru_ru: {0} ТБ

# TransferStatus_Canceled_Text
source: Cancelled
ru_ru: Отменено

# TransferStatus_Completed_Text
source: Completed
ru_ru: Завершено

# TransferStatus_Error_Text
source: Error
ru_ru: Ошибка

# TransferStatus_Idle_Text
source: Idle...
ru_ru: Ожидание...

# TransferStatus_PausedByApplication_Text
source: Paused
ru_ru: Приостановлено

# TransferStatus_PausedCostedNetwork_Text
source: Costed network
ru_ru: Платная сеть

# TransferStatus_PausedNoNetwork_Text
source: No connection
ru_ru: Соединение отсутствует

# TransferStatus_Running_Text
source: In progress...
ru_ru: Выполняется...

# AppBarButton_UploadFile.Label
source: upload file
ru_ru: отправить файл

# AppLoader_CancelAllUploads
source: Cancelling all uploads...
ru_ru: Отмена всех отправок...

# FileSize_SizeText.Text
source: Size:
ru_ru: Размер:

# Message_PostUploads_ConnectionError_Text
source: Connection error. Check your connection to the network. The next time we will repeat again to complete the upload of {0}.
ru_ru: Ошибка соединения. Проверьте подключение к сети. При следующем запуске мы повторим попытку завершить отправку {0}.

# Message_PostUploads_Error_Title
source: Couldn't finish the upload
ru_ru: Не удалось завершить отправку

# Message_PostUploads_ServerError_105_Text
source: Unable to save file.
ru_ru: Невозможно сохранить файл.

# Message_PostUploads_ServerError_123_Text
source: Audio format is invalid.
ru_ru: Недопустимый формат аудиозаписи.

# Message_PostUploads_ServerError_204_Text
source: Access denied.
ru_ru: Нет доступа.

# Message_PostUploads_ServerError_214_Text
source: Don't have permission to add a post.
ru_ru: Нет прав на добавление поста.

# Message_PostUploads_ServerError_270_Text
source: An audio recording was withdrawn upon request of the copyright owner and can't be uploaded.
ru_ru: Аудиозапись была изъята по запросу правообладателя и не может быть загружена.

# Message_PostUploads_ServerError_301_Text
source: Invalid file name.
ru_ru: Недопустимое имя файла.

# Message_PostUploads_ServerError_302_Text
source: Invalid file size.
ru_ru: Недопустимый размер файла.

# Message_PostUploads_ServerError_Text
source: The server returned an error, and we can't finish upload of {0}. Error code: {1} - {2}
ru_ru: Сервер вернул ошибку, и мы не можем завершить отправку {0}. Код: {1} - {2}

# Message_PostUploads_ServerError_Unknown_Text
source: Unknown error.
ru_ru: Неизвестная ошибка.

# Message_PostUploads_UnknownAppError_Text
source: An unknown error occurred, and we can't finish upload of {0}.
ru_ru: Произошла неизвестная ошибка, и мы не можем завершить отправку {0}.

# Message_Uploads_CantPrepareData_Text
source: Couldn't prepare data:
ru_ru: Не удалось подготовить данные:

# Message_Uploads_MaxUploadsExceeded_Text
source: Maximum uploads number exceeded:
ru_ru: Достигнуто максимальное количество отправок:

# Message_Uploads_PreprocessionConnectionError_Text
source: A connection error occurred, and we can't start upload of {0}. Check your network connection and try again.
ru_ru: Произошла ошибка соединения, и мы не можем начать отправку {0}. Проверьте подключение к сети и повторите попытку.

# Message_Uploads_PreprocessionError_Title
source: Couldn't prepare file to upload
ru_ru: Не удалось подготовить файл к отправке

# Message_Uploads_PreprocessionServerError_Text
source: The server returned an error, and we can't start upload of {0}. Please try again later. Error code: {1} - {2}
ru_ru: Сервер вернул ошибку, и мы не можем начать отправку {0}. Повторите попытку позднее. Код: {1} - {2}

# Message_Uploads_StartUploading_Title
source: Failed to start upload
ru_ru: Не удалось начать отправку

# Message_Uploads_UnknownError_Text
source: Unknown error:
ru_ru: Неизвестная ошибка:

# Toast_PostUploads_Success_Text
source: Upload completed!
ru_ru: Отправка завершена!

# TransferView_CancelAllUploadsButton.Label
source: cancel all uploads
ru_ru: отменить все отправки

# UploadFileView_SelectAnotherFileButton.Content
source: select another
ru_ru: выбрать другой

# UploadFileView_SelectFileButton.Content
source: select file
ru_ru: выбрать файл

# UploadFileView_SelectTypeBox.Header
source: What will send?
ru_ru: Что отправим?

# UploadFileView_SelectTypeBox_Audio.Content
source: audio
ru_ru: аудиозапись

# UploadFileView_SelectTypeBox_Doc.Content
source: document
ru_ru: документ

# UploadFileView_SelectTypeBox_Video.Content
source: video
ru_ru: видеозапись

# UploadFileView_Title.Text
source: upload file
ru_ru: отправить файл

# UploadFileView_UploadFileButton.Content
source: upload
ru_ru: отправить

# Toast_Downloads_Fail_Text
source: Download failed
ru_ru: Ошибка загрузки

# Toast_Downloads_Success_Text
source: Download completed!
ru_ru: Загрузка завершена!

# Toast_Uploads_Fail_Text
source: Upload failed
ru_ru: Ошибка отправки

# Toast_Uploads_SuccessReturn_Text
source: Go back to finish
ru_ru: Вернитесь для завершения

# Message_Uploads_PreprocessionUnknownError_Text
source: An unknown error occurred, and we can't start uploading of {0}.
ru_ru: Произошла неизвестная ошибка, и мы не можем начать отправку {0}.

# UploadFileView_VideoSettings_DescriptionBox.Header
source: Description
ru_ru: Описание видео

# UploadFileView_VideoSettings_NameBox.Header
source: Title
ru_ru: Название видео

# UploadFileView_VideoSettings_RepeatSwitch.Header
source: Loop playback
ru_ru: Зациклить воспроизведение

# UploadFileView_VideoSettings_Title.Text
source: Video options
ru_ru: Параметры видео

# UploadFileView_VideoSettings_WallPostSwitch.Header
source: Post on wall
ru_ru: Опубликовать на стене

# Toast_PostUploads_Fail_Text
source: Upload could't be complete
ru_ru: Отправка не может быть завершена

# FirstInternetSettingsView_ContentText.Text
source: VK Saver can download photos and album covers for your tracks. Load the data (additional charges may apply operator)? You can always change this parameter in the settings.
ru_ru: ВКачай может загрузить фотографии исполнителей и обложки альбомов для ваших треков. Загружать эти данные (может взиматься дополнительная плата оператором)? Этот параметр всегда можно изменить в настройках.

# FirstInternetSettingsView_Title.Text
source: Access to the Internet
ru_ru: Доступ к интернету

# FirstStartRetryView_ContentText.Text
source: Glad to see you again! The last time we not complete a few moments. Let's continue!
ru_ru: Рады видеть вас снова! В прошлый раз мы не завершили несколько моментов. Давайте продолжим!

# FirstStartRetryView_ContinueButton.Content
source: continue
ru_ru: продолжить

# FirstStartRetryView_Title.Text
source: Welcome back!
ru_ru: С возвращением!

# FirstStartView_ContentText.Text
source: VK Saver need to search audio files on your Smartphone before you can play them (this must be done only once). Note that VK Saver can find audio files only in the Music folder in the Smartphone's memory or on the SD card. Next, we will help you to configure some basic application settings. Tap button below when you're ready.
ru_ru: ВКачай необходимо выполнить поиск аудиофайлов на вашем смартфоне, прежде чем вы сможете их воспроизвести (это необходимо выполнить лишь однажды). Обратите внимание, что ВКачай сможет найти аудиофайлы только в папке Музыка в памяти смартфона или на SD-карте. Далее мы поможем настроить несколько основных параметров приложения. Нажмите кнопку ниже, когда будете готовы.

# FirstStartView_LetsGoButton.Content
source: let's go
ru_ru: приступить

# FirstStartView_NoButton.Content
source: no
ru_ru: нет

# FirstStartView_Title.Text
source: Let's get started!
ru_ru: Давайте начнем!

# FirstStartView_WiFiButton.Content
source: only via Wi-Fi
ru_ru: только через Wi-Fi

# FirstStartView_YesButton.Content
source: yes
ru_ru: да

# UpdatingDatabaseView_ContentText.Text
source: VK Saver is searching for your tracks. Please wait...
ru_ru: ВКачай выполняет сканирование ваших треков. Пожалуйста, подождите...

# UpdatingDatabaseView_SearchingAlbumsStep_Text
source: Downloading album covers... {0} of {1}
ru_ru: Рисуем обложки альбомов... {0} из {1}

# UpdatingDatabaseView_SearchingArtistsStep_Text
source: Downloading artists images... {0} of {1}
ru_ru: Фотографируем исполнителей... {0} из {1}

# UpdatingDatabaseView_StepMask_Text
source: Step {0} of {1}
ru_ru: Шаг {0} из {1}

# UpdatingDatabaseView_Title.Text
source: Updating database
ru_ru: Обновление базы данных

# UpdatingDatabseView_PreparingDatabaseStep_Text
source: Rewriting the manuscripts... {0} of {1}
ru_ru: Переписываем манускрипты... {0} из {1}

# UpdatingDatabseView_SearchingFilesStep_Text
source: Looking for audio files... {0} of {1}
ru_ru: Ищем аудиофайлы... {0} из {1}

# UpdatingDatabseView_StartedStep_Text
source: Preparing database...
ru_ru: Снаряжаем рыцарей...

# AppBarButton_Search.Label
source: search
ru_ru: поиск

# DetailsView_Subtitle.Text
source: details
ru_ru: подробнее

# LocalFolderView_Title.Text
source: FOLDER
ru_ru: ПАПКА

# LocalGenreView_Title.Text
source: GENRE
ru_ru: ЖАНР

# LibraryView_AlbumsLoader.ErrorText
source: Failed to load the list of albums
ru_ru: Не удалось загрузить список альбомов

# LibraryView_AlbumsLoader.LoadingText
source: Loading albums list...
ru_ru: Загружаем список альбомов...

# LibraryView_AlbumsLoader.NoDataText
source: In your collection no one album
ru_ru: В вашей коллекции нет ни одного альбома

# LibraryView_ArtistsLoader.ErrorText
source: Failed to load the list of artists
ru_ru: Не удалось загрузить список исполнителей

# LibraryView_ArtistsLoader.LoadingText
source: Loading artists list...
ru_ru: Загружаем список исполнителей...

# LibraryView_ArtistsLoader.NoDataText
source: In your collection no one artist
ru_ru: В вашей коллекции нет ни одного исполнителя

# LibraryView_CachedLoader.ErrorText
source: Failed to load the list of cached audio
ru_ru: Не удалось загрузить список кэшированных аудиозаписей

# LibraryView_CachedLoader.LoadingText
source: Loading the list of cached audios...
ru_ru: Загружаем список кэшированных аудиозаписей...

# LibraryView_CachedLoader.NoDataText
source: In your collection no one cached audios
ru_ru: В вашей коллекции нет ни одной кэшированной аудиозаписи

# LibraryView_FoldersLoader.ErrorText
source: Failed to load the list of folders
ru_ru: Не удалось загрузить список папок

# LibraryView_FoldersLoader.LoadingText
source: Loading folders list...
ru_ru: Загружаем список папок...

# LibraryView_FoldersLoader.NoDataText
source: In your collection no one folder
ru_ru: В вашей коллекции нет ни одной папки

# LibraryView_GenresLoader.ErrorText
source: Failed to load the list of genres
ru_ru: Не удалось загрузить список жанров

# LibraryView_GenresLoader.LoadingText
source: Loading genres list...
ru_ru: Загружаем список жанров...

# LibraryView_GenresLoader.NoDataText
source: In your collection no one genre
ru_ru: В вашей коллекции нет ни одного жанра

# LibraryView_PivotItem_Albums.Header
source: albums
ru_ru: альбомы

# LibraryView_PivotItem_Artists.Header
source: artists
ru_ru: исполнители

# LibraryView_PivotItem_Cached.Header
source: cached tracks
ru_ru: кэшированные

# LibraryView_PivotItem_Folders.Header
source: folders
ru_ru: папки

# LibraryView_PivotItem_Genres.Header
source: genres
ru_ru: жанры

# LibraryView_PivotItem_Tracks.Header
source: tracks
ru_ru: композиции

# LibraryView_TracksLoader.ErrorText
source: Failed to load the list of tracks
ru_ru: Не удалось загрузить список композиций

# LibraryView_TracksLoader.LoadingText
source: Loading tracks list...
ru_ru: Загружаем список композиций...

# LibraryView_TracksLoader.NoDataText
source: In your collection there are no tracks
ru_ru: В вашей коллекции нет ни одной композиции

# MainView_AlbumsItem.Content
source: albums
ru_ru: альбомы

# MainView_ArtistsItem.Content
source: artists
ru_ru: исполнители

# MainView_FoldersItem.Content
source: folders
ru_ru: папки

# MainView_GenresItem.Content
source: genres
ru_ru: жанры

# MainView_HubSection_LocalLibrary.Header
source: LOCAL LIBRARY
ru_ru: ЛОКАЛЬНАЯ БИБЛИОТЕКА

# MainView_LocalTracksItem.Content
source: tracks
ru_ru: композиции

# PromoView_Screen3_Line1_Text
source: World music charts
ru_ru: Локальная библиотека

# PromoView_Screen3_Line2_Text
source: Playing tracks of top artists and other charts
ru_ru: Воспроизводите свои локальные аудиозаписи
